app/views/add_developers/new.html.erb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  <div class="col-md-4 col-md-offset-4">
  	<% @project = Project.find(params[:id]) %>
    <%= form_for(@relation, url: "/projects/#{@project.id}/add_developers", method: :post) do |f| %>
    <% users = User.all %>