app/views/users/show.html.erb

SELECT "relations".* FROM "relations" WHERE "relations"."assign_id" = $1  [["assign_id", 1]]
---
<div class="container backgr">
	<% @relation = Relation.where(assign_id: @user.id) %>

SELECT "projects".* FROM "projects" INNER JOIN "relations" ON "projects"."id" = "relations"."project_id" WHERE "relations"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
		<% @relation.each do |pr| %>
			<% project = Project.find(pr.project_id) %>
			<% user = User.find(project.user_id) %>