app/views/projects/edit_issue.html.erb

SELECT "users".* FROM "users"
---
      <br/>
      <% users = User.all %>