app/views/projects/new_issue.html.erb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<h1>Create issue</h1>
<% @project = Project.find(params[:iid]) %>

SELECT "users".* FROM "users"
---
      <br/>
      <% users = User.all %>