app/views/projects/show_issue.html.erb

SELECT "issues".* FROM "issues" WHERE "issues"."project_id" = $1  [["project_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<% else %>
	<% @project.issues.each do |pr| %>
		<% assign = User.find(pr.assign_id) %>