app/views/projects/show_issue_create.html.erb

	<% provide(:title, "Issue - #{@issue.id}") %>
	<% assign = User.find(@issue.assign_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	<% for i in 0...log.count %>
		<% issue = Issue.find(log[i].issue_id) %>
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]