app/controllers/account_activations_controller.rb

	def edit
		user = User.find_by(email: params[:email])
    if user && !user.activated? && user.authenticated?(:activation, params[:id])
      user.update_attribute(:activated,    true)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ndchinh93@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "activated_at" = $2 WHERE "users"."id" = $3  [["updated_at", 2017-03-29 04:45:15 UTC], ["activated_at", 2017-03-29 04:45:15 UTC], ["id", 1]]