app/controllers/add_developers_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
  	@relation = Relation.new
    project = Project.find_by(id: params[:id])
    @rela = Relation.where(project_id: project.id)
    users = User.all
    @assign = []
    @exist = []
    @rela.each.with_index do |rela,i|
      @assign[i] = User.find_by(id: rela.assign_id)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "relations" ("assign_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["assign_id", 2], ["project_id", 1], ["created_at", 2017-04-04 08:30:50 UTC], ["updated_at", 2017-04-04 08:30:50 UTC]]
---
  def create
  	@relation = Relation.new(params_add_developer)
  	project = Project.find(@relation.project_id)
  	if @relation.valid? && @relation.assign_id != project.user_id
			@relation.save