app/controllers/issues_controller.rb

	def edit
		@project = Project.find(params[:id])
		@issue = Issue.find(params[:iid])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]