app/controllers/projects_controller.rb

	def new
		@project = Project.new
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@project = Project.new(params_project)
		user = User.find(@project.user_id)
		if @project.valid?
			flash.now[:success] = "Create project success"
			@project.save
			@relation = Relation.create(assign_id: @project.user_id, project_id: @project.id)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "projects" ("project_name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["project_name", "asdcdrw"], ["description", "wqe23t43twefdadsd"], ["user_id", 1], ["created_at", 2017-03-29 08:02:15 UTC], ["updated_at", 2017-03-29 08:02:15 UTC]]
INSERT INTO "relations" ("assign_id", "project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["assign_id", 0], ["project_id", 2], ["user_id", 1], ["created_at", 2017-04-04 07:36:33 UTC], ["updated_at", 2017-04-04 07:36:33 UTC]]

	def show
		@project = Project.find_by(id: params[:iid])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def edit
		@project = Project.find_by(id: params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@project = Project.find_by(id: params[:id])
		if @project.update_attributes(params_project_edit)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "description" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["description", "Anh Thang: Lam front-end du an\r\nAnh Duc: Supporter cho anh Thang\r\nContinue..."], ["updated_at", 2017-03-31 01:49:35 UTC], ["id", 3]]

	def destroy
		project = Project.find(params[:id])
		project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 7]]

	def new_issue
		@issue = Issue.new
		@project = Project.find(params[:iid])
		@status = ['New', 'Inprogress', 'Resolved', 'Closed']
		@priority = ['Low','Normal','Hight','Urgent','Immediate']
		@rela = Relation.where(project_id: @project.id)
		@assign = []
		@rela.each.with_index do |rela,i|
      @assign[i] = User.find_by(id: rela.assign_id)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create_issue
		@project = Project.find(params[:iid])
		@issue = Issue.new(params_issue)
		if @issue.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "issues" ("issue_name", "issue_decription", "user_id", "assign_id", "start_date", "due_date", "created_at", "updated_at", "project_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

	def show_issue_create
		@issue = Issue.find(params[:id])
		@user = User.find(@issue.user_id)
		@project = Project.find(params[:iid])
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

	def show_issue
		@project = Project.find(params[:iid])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def edit_issue
		@project = Project.find(params[:iid])
		@issue = Issue.find(params[:id])
		@user = User.find(@issue.user_id)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def update_issue
		@project = Project.find(params[:iid])
		@issue = Issue.find(params[:id])
		if @issue.update_attributes(params_issue)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "issues" SET "issue_name" = $1, "issue_decription" = $2, "updated_at" = $3 WHERE "issues"."id" = $4  [["issue_name", "DEFGHI"], ["issue_decription", "Sua mai moi duoc"], ["updated_at", 2017-03-31 04:33:01 UTC], ["id", 13]]

	def destroy_issue
		issue = Issue.find(params[:id])
		issue.destroy
		flash.now[:success] = "Issue deleted"
		project = Project.find(issue.project_id)
		user = User.find(current_user.id)
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "issues" WHERE "issues"."id" = $1  [["id", 13]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]