app/controllers/sessions_controller.rb

  def create
  	user = User.find_by(account: params[:session][:account])
---
SELECT  "users".* FROM "users" WHERE "users"."account" = $1 LIMIT $2  [["account", "chinhnd"], ["LIMIT", 1]]