app/controllers/users_controller.rb

INSERT INTO "users" ("email", "account", "created_at", "updated_at", "password_digest", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
  	@user = User.new(params_user)
  	if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$SVPUoWo9kR0eOZ.r19ywK.3lVmN5gEMIUKbh5Wz7RZ5DTPN65La9q"], ["updated_at", 2017-03-31 01:30:53 UTC], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params_user)